# joining

In [1]:
import numpy as np 
import pandas as pd

In [18]:
df1 = pd.DataFrame({
    'name' : ['kaushik','Raj','Pankaj']
},index=[1,2,3])

df2 = pd.DataFrame({
    'Score' : [10,2,13]
},index=[2,3,4])

In [22]:
df1

      name
1  kaushik
2      Raj
3   Pankaj

In [20]:
df2

   Score
2     10
3      2
4     13

In [23]:
df1.join(df2)

      name  Score
1  kaushik    NaN
2      Raj   10.0
3   Pankaj    2.0

In [24]:
# inner
df1.join(df2,how='inner')

     name  Score
2     Raj     10
3  Pankaj      2

In [25]:
# outer
df1.join(df2,how='outer')

      name  Score
1  kaushik    NaN
2      Raj   10.0
3   Pankaj    2.0
4      NaN   13.0

In [26]:
# left
df1.join(df2,how='left')

      name  Score
1  kaushik    NaN
2      Raj   10.0
3   Pankaj    2.0

In [27]:
# right
df1.join(df2,how='right')

     name  Score
2     Raj     10
3  Pankaj      2
4     NaN     13